<?php
// +----------------------------------------------------------------------
// | JunThink - 'demo1'插件的介绍信息
// +----------------------------------------------------------------------
// | Copyright (c) 2017 www.junphp.com/think/
// +----------------------------------------------------------------------
// | Author: 小黄牛 <1731223728@qq.com>
// +----------------------------------------------------------------------
return array(
	'name'    => 'demo1',//插件名
	'hook'    => 'demo1',//钩子名
	'title'   => 'demo1',//插件别名
	'edition' => 'V1.0',//版本
	'content' => '这是一个需要安装卸载的插件',//插件介绍
	'author'  => 'JunThink官方',//开发者
	'type' => '1',//插件状态
	'install' => '1',//是否需要安装
	'time'    => '2017-10-09 05:53:36',//发布时间
);